documents/forms-over-finite-fields/forms.tex
% Created 2025-06-09 Mon 15:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}

%%--------------------------------------------------------------------------------

\usepackage[svgnames]{xcolor}
\usepackage{mathrsfs}
\usepackage{tikz-cd}
\usepackage{svg}
\usepackage[top=25mm,bottom=25mm,left=25mm,right=30mm]{geometry}


\usepackage{amsthm}
\usepackage{thmtools}
\usepackage{cleveref}
\usepackage{stmaryrd}

%%\usepackage[outputdir=build]{minted}
\usepackage{minted}
\usemintedstyle{tango}
\usepackage[svgnames]{xcolor}
\setminted[bash]{bgcolor=NavajoWhite}
\setminted[python]{bgcolor=Lavender}
\setminted[sage]{bgcolor=Lavender}

\usepackage{titlesec}
%%\newcommand{\sectionbreak}{\clearpage}


\renewcommand{\descriptionlabel}[1]{\hspace{\labelsep}#1}


\usepackage[cal=boondox]{mathalfa}


\newenvironment{referee}{\color{red}}{\color{black}}

\numberwithin{equation}{section}

\declaretheorem[numberwithin=subsection,Refname={Theorem,Theorems}]{theorem}
\declaretheorem[sibling=theorem,name=Proposition,Refname={Proposition,Propositions}]{proposition}
\declaretheorem[sibling=theorem,name=Corollary,Refname={Corollary,Corollaries}]{corollary}
\declaretheorem[sibling=theorem,name=Lemma,Refname={Lemma,Lemmas}]{lemma}
\declaretheorem[sibling=theorem,name=Remark,style=remark,Refname={Remark,Remarks}]{remark}
\declaretheorem[sibling=theorem,name=Problem,style=remark,Refname={Problem,Problems}]{problem}
\declaretheorem[sibling=theorem,name=Example,style=remark,Refname={Example,Examples}]{ex}
\declaretheorem[sibling=theorem,name=Definition,style=remark,Refname={Definition,Definitions}]{definition}

\crefname{equation}{}{}

%%--------------------------------------------------------------------------------

\newenvironment{solution}
{\par \color{red}\hrulefill \newline \noindent \textbf{Solution:} \vspace{2mm}}
{\vspace{2mm} \color{black}}


\newcommand{\totdeg}{\operatorname{totdeg}}
\newcommand{\content}{\operatorname{content}}

\newcommand{\Mat}{\operatorname{Mat}}
\newcommand{\Hom}{\operatorname{Hom}}

\newcommand{\Aut}{\operatorname{Aut}}
\newcommand{\Gal}{\operatorname{Gal}}

\newcommand{\A}{\mathscr{A}}
\newcommand{\B}{\mathscr{B}}
\newcommand{\FF}{\mathscr{F}}
\newcommand{\LF}{\mathcal{LF}}

\newcommand{\HH}{\mathcal{H}}
\newcommand{\X}{\mathscr{X}}

\newcommand{\ff}{\mathfrak{f}}
\newcommand{\pp}{\mathfrak{p}}

\newcommand{\Z}{\mathbb{Z}}
\newcommand{\Nat}{\mathbb{N}}
\newcommand{\Q}{\mathbb{Q}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\C}{\mathbb{C}}
\newcommand{\F}{\mathbb{F}}

\newcommand{\PP}{\mathbb{P}}

\newcommand{\Poly}{\mathcal{P}}
%%--------------------------------------------------------------------------------
\author{George McNinch}
\date{2025-06-09 15:43:34 EDT (george@sortilege)}
\title{Forms over a finite field}
\hypersetup{
 pdfauthor={George McNinch},
 pdftitle={Forms over a finite field},
 pdfkeywords={linear-algebra, finite-fields, bilinear-forms},
 pdfsubject={},
 pdfcreator={Emacs 30.0.92 (Org mode 9.7.11)}, 
 pdflang={English}}
\usepackage{calc}
\newlength{\cslhangindent}
\setlength{\cslhangindent}{1.5em}
\newlength{\csllabelsep}
\setlength{\csllabelsep}{0.6em}
\newlength{\csllabelwidth}
\setlength{\csllabelwidth}{0.45em * 0}
\newenvironment{cslbibliography}[2] % 1st arg. is hanging-indent, 2nd entry spacing.
 {% By default, paragraphs are not indented.
  \setlength{\parindent}{0pt}
  % Hanging indent is turned on when first argument is 1.
  \ifodd #1
  \let\oldpar\par
  \def\par{\hangindent=\cslhangindent\oldpar}
  \fi
  % Set entry spacing based on the second argument.
  \setlength{\parskip}{\parskip +  #2\baselineskip}
 }%
 {}
\newcommand{\cslblock}[1]{#1\hfill\break}
\newcommand{\cslleftmargin}[1]{\parbox[t]{\csllabelsep + \csllabelwidth}{#1}}
\newcommand{\cslrightinline}[1]
  {\parbox[t]{\linewidth - \csllabelsep - \csllabelwidth}{#1}\break}
\newcommand{\cslindent}[1]{\hspace{\cslhangindent}#1}
\newcommand{\cslbibitem}[2]
  {\leavevmode\vadjust pre{\hypertarget{citeproc_bib_item_#1}{}}#2}
\makeatletter
\newcommand{\cslcitation}[2]
 {\protect\hyper@linkstart{cite}{citeproc_bib_item_#1}#2\hyper@linkend}
\makeatother\begin{document}

\maketitle
\section{Some references}
\label{sec:org677c2dd}

\begin{itemize}
\item Simeon Ball - ``Finite Geometries and Combinatorial Applications'' (2015, Cambridge Univ Press)

(available electronically via Tufts' Tisch Library)

\item \emph{Linear algebra and matrices : topics for a second course}
Shapiro, Helene, 1954-
Providence, Rhode Island : American Mathematical Society, 2015

\item some \href{https://personal.math.ubc.ca/\~cass/siegel/FiniteFields.pdf}{notes of Bill Casselmann (UBC)}
\end{itemize}
\section{Statements}
\label{sec:org2983188}

Here is an overview of the results I'd like to see formalized. For
alternating forms, there is no need to put any hypotheses on the
field. For symmetric forms, we'll consider finite fields.


Let \(V\) be a finite dimensional vector space over a (any!) field
\(k\) and let \(\beta:V \times V \to k\) be a bilinear form.

We write \(V^\vee\) for the dual of \(V\) -- i.e. the set
\(\Hom_k(V,k)\) of all linear maps \(V \to k\).  Then \(V^\vee\) is
again a vector space over \(k\) and \(\dim V = \dim V^\vee.\)

Notice that \(\beta\) determines a linear mapping
\[\Phi_\beta:V \to \Hom_k(V,k)\] by the rule
\(v \mapsto \beta(v,-).\)

Thus for \(v \in V\), \(\Phi_\beta(v)\) is the linear mapping which for \(w\in V\) satisfies
\[\Phi_\beta(v)(w) = \beta(v,w).\]

The form \(\beta\) is \emph{non-degenerate} provided that the linear mapping
\(\Phi_\beta\) is an invertible.

If \(e_1,\cdots,e_d\) is a basis for \(V\), the \emph{matrix of \(\beta\)}
for this basis is the \(d \times d\) matrix whose \(i,j\) entry is
\(\beta(e_i,e_j)\).

\begin{lemma}
The following are equivalent for \(\beta\):
\begin{description}
\item[{(1)}] \(\beta\) is non-degenerate
\item[{(2)}] \(\beta(v,w) = 0\) for every \(w \in V\) implies that \(v = 0\).
\item[{(3)}] \(\det M\ne 0\) where \(M\) is the matrix of \(\beta\) with
respect to some (any) basis of \(V\).
\end{description}
\label{lemma:non-deg-condition}
\end{lemma}

If \(W \subset V\) is a subspace, we say that \(W\) is nondegenerate
if the restriction \(\beta_{\mid W}\) is a non-degenerate form on
\(W\).

(Notice!: we write \(\beta_{\mid W}\) for the restriction, but really
this means the restriction of the function \(\beta\) from \(V\times V\)
to \(W \times W\)).

\begin{lemma}
Let \(W_1,W_2\) be non-degenerate subspaces of \(V\).
Suppose that
\begin{description}
\item[{(1)}] \(W_1 \cap W_2 = 0\).
\item[{(2)}] \(\beta(W_1,W_2) = 0\) -- i.e. \(\beta(w_1,w_2) = 0\) for all
\(w_1 \in W_1\) and all \(w_2 \in W_2\).
\end{description}
Then \(W_1 + W_2\) is a non-degenerate subspace.
\label{lemma:orthog-sum}
\end{lemma}

Suppose that \(W\) is a subspace of \(V\). We say that Then \(W\) is
said to be the \emph{orthogonal sum} of the subspaces \(W_1, W_2\)
if \(W= W_1 + W_2\) and if \(W_1\) and \(W_2\) satisfy the hypotheses
of the previous Lemma.
\subsection{Equivalence of forms}
\label{sec:equivalence-of-forms}
Let \(V_1,\beta_1\) and \(V_2,\beta_2\) be pairs each consisting of a
vector space together with a bilinear form.

We say that \(V_1,\beta_1\) is \emph{isomorphic} to \(V_2,\beta_2\) if
there is an invertible linear mapping \(\phi:V_1 \to V_2\) such that
for every \(x,y \in V_1\), we have \[\beta_1(x,y) =
\beta_2(\phi(x),\phi(y)).\]

We then say that \(\phi\) is an \emph{isomorphism}.

\begin{lemma}
Suppose that that \(V_1,\beta_1\) is \emph{isomorphic} to \(V_2,\beta_2\).
Then \(\beta_1\) is non-degenerate if and only if \(\beta_2\) is
non-degenerate.
\label{lemma:isomorphism-preserves-nondegen}
\end{lemma}
\subsection{Alternating forms}
\label{sec:alternating-forms}
We say that \(\beta\) is \emph{alternating} (or \emph{skew-symmetric}) if
\(\beta(x,x) = 0\) for every \(x \in V\).

\begin{lemma}
If \(\beta\) is alternating then \(\beta(x,y) = -\beta(y,x)\) for each
\(x,y \in V\). If the characteristic of \(k\) is not 2, the converse
also holds.
\label{lemma:alt-skew}
\end{lemma}

Suppose that \(\beta\) is alternating.
A 2 dimensional subspace \(W\) of \(V\) is said to be \emph{hyperbolic} if \(W\) has a basis
\(e,f\) such that \(\beta(e,f) = 1\).

Note that a hyperbolic subspace is non-degenerate (use
\Cref{lemma:non-deg-condition} and the fact that \(\det \begin{bmatrix}
0 & 1 \\ -1 & 0 \end{bmatrix}\) is non-zero).

More generally, a subspace \(W\) of dimension \(\ge 2\) is said to be
\emph{hyperbolic} if \(W\) is the orthogonal sum of subspaces \(W_1,W_2\)
where \(W_1\) is hyperbolic of dimension 2, and \(W_2\) is either
itself hyperbolic or zero.

\begin{lemma}
Suppose that \(V_1,\beta_1\) and \(V_2,\beta_2\) are spaces of vector
spaces together with alternating forms \(\beta_i\). If \(W_1\) is a
hyperbolic subspace of \(V_1\) and if \(W_2\) is a hyperbolic subspace
of \(V_2\) then \(W_1,\beta_{1\mid W_1}\) and \(W_2,\beta_{2\mid W_2}\)
are isomorphic.
\label{lemma:hyperbolic-equiv}
\end{lemma}

\begin{lemma}
If \(W\) is a hyperbolic subspace of \(V\), then \(W\) is
non-degenerate and \(\dim W\) is even.
\label{lemma:hyperbolic-even-dimensional}
\end{lemma}

\begin{theorem}
Suppose that \(\beta\) is a non-degenerate alternating form on
\(V\). Then \(V\) is hyperbolic. In particular, \(\dim V\) is even. 
\label{theorem:alternating-forms-are-hyperbolic}
\end{theorem}

\begin{corollary}
Suppose for \(i=1,2\) that \(V_i,\beta_i\) is a space \(V_i\) together
with a non-degenerate alternating form \(\beta_i\) on \(V_i\).
If \(\dim V_1 = \dim V_2\) then \(V_1,\beta_1\) is isomorphic to
\(V_2,\beta_2\).
\label{corollary:alternating-forms-classified}
\end{corollary}
\subsection{Symmetric forms}
\label{sec:symmetric-forms}
\ldots{}
\end{document}
